request.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:prom="http://psp.idt.net/PromoService/">
   <soapenv:Header/>
   <soapenv:Body>
      <prom:AddImmediatePromotionRequest>
         <prom:Control>
         <prom:User>aklock</prom:User>
         <prom:UserType>SOAP</prom:UserType>
         </prom:Control>
         <prom:Params>
            <prom:PromoName>June_Codes_POPSQ_239</prom:PromoName>
            <prom:Description>June_Codes_POPSQ_239</prom:Description>
            <prom:BrChannel>BR_US</prom:BrChannel>
            <prom:TriggeringEvent>RECHARGE</prom:TriggeringEvent>
            <prom:QualifyingAmount>500</prom:QualifyingAmount>
            <prom:PromoCodeSource>STATIC</prom:PromoCodeSource>
            <prom:RewardMethod>BONUS</prom:RewardMethod>
            <prom:RewardValueType>PERCENT</prom:RewardValueType>
            <prom:RewardValue>20</prom:RewardValue>
            <prom:QualifyingAmountMax>5000</prom:QualifyingAmountMax>
            <prom:PromoClass>14078</prom:PromoClass>
            </prom:Params>
      </prom:AddImmediatePromotionRequest>
   </soapenv:Body>
</soapenv:Envelope>